Revit 2024 API
SunAndShadowSettings.Longitude Property
 Identifies the current longitude used by the SunAndShadowSettings element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double Longitude { get; }
Visual Basic
Public ReadOnly Property Longitude As Double
	Get
Visual C++
public:
property double Longitude {
	double get ();
}
See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace